## DATAFRAME

- Combinations of Series

In [17]:
import pandas as pd
import numpy as nb

In [18]:
data = {
    "Name":[ "Pankaj", "Rahul","Aditya"],
    "Age": [22,21,23],
    "Town": ["Nagpur","Mumbai","Pune"],
    "Salary": [25000,30000,28000 ]
}
df =pd.DataFrame(data)
df

     Name  Age    Town  Salary
0  Pankaj   22  Nagpur   25000
1   Rahul   21  Mumbai   30000
2  Aditya   23    Pune   28000

In [19]:
data_list = [
    ["Pankaj", 22, "Nagpur", 25000],
    ["Rahul", 21, "Mumbai", 30000],
    ["Aditya", 23, "Pune", 28000 ]
]

Columns = ["Name","Age","Town","Salary"]
df2 = pd.DataFrame(data_list, columns=Columns)
df2

     Name  Age    Town  Salary
0  Pankaj   22  Nagpur   25000
1   Rahul   21  Mumbai   30000
2  Aditya   23    Pune   28000

- SELECTION AND INDEXING COLUMNS

In [20]:
df2

     Name  Age    Town  Salary
0  Pankaj   22  Nagpur   25000
1   Rahul   21  Mumbai   30000
2  Aditya   23    Pune   28000

In [21]:
df2[["Name", "Age"]]

     Name  Age
0  Pankaj   22
1   Rahul   21
2  Aditya   23

* CREATING NEW COLUMN

In [22]:
df2["Designation"] = ["Data Analyst", "Data Scientists", "Data Engineer"]
df2

     Name  Age    Town  Salary      Designation
0  Pankaj   22  Nagpur   25000     Data Analyst
1   Rahul   21  Mumbai   30000  Data Scientists
2  Aditya   23    Pune   28000    Data Engineer

* REMOVING COLUMNS

In [23]:
df2.drop(0,axis=0)

     Name  Age    Town  Salary      Designation
1   Rahul   21  Mumbai   30000  Data Scientists
2  Aditya   23    Pune   28000    Data Engineer

In [24]:
df2

     Name  Age    Town  Salary      Designation
0  Pankaj   22  Nagpur   25000     Data Analyst
1   Rahul   21  Mumbai   30000  Data Scientists
2  Aditya   23    Pune   28000    Data Engineer

In [26]:
df2.drop("Designation", axis=1)

     Name  Age    Town  Salary
0  Pankaj   22  Nagpur   25000
1   Rahul   21  Mumbai   30000
2  Aditya   23    Pune   28000

In [33]:
df2.drop(1,axis=0)

     Name  Age    Town  Salary    Designation
0  Pankaj   22  Nagpur   25000   Data Analyst
2  Aditya   23    Pune   28000  Data Engineer

* SELECTING ROWS

In [34]:
df2

     Name  Age    Town  Salary      Designation
0  Pankaj   22  Nagpur   25000     Data Analyst
1   Rahul   21  Mumbai   30000  Data Scientists
2  Aditya   23    Pune   28000    Data Engineer

In [35]:
df2.loc[0]

Name                 Pankaj
Age                      22
Town                 Nagpur
Salary                25000
Designation    Data Analyst
Name: 0, dtype: object

In [38]:
df2.loc[[1,0]]

     Name  Age    Town  Salary      Designation
1   Rahul   21  Mumbai   30000  Data Scientists
0  Pankaj   22  Nagpur   25000     Data Analyst

In [39]:
df.iloc[0]

Name      Pankaj
Age           22
Town      Nagpur
Salary     25000
Name: 0, dtype: object

In [40]:
df.loc[[2,0], ["Name", "Town"]]

     Name    Town
2  Aditya    Pune
0  Pankaj  Nagpur

* CONDITION SELECTION

In [41]:
df2

     Name  Age    Town  Salary      Designation
0  Pankaj   22  Nagpur   25000     Data Analyst
1   Rahul   21  Mumbai   30000  Data Scientists
2  Aditya   23    Pune   28000    Data Engineer

In [42]:
# I Only want to see those rows where Age is greater than 23
df2[df2["Age"] > 22]

     Name  Age  Town  Salary    Designation
2  Aditya   23  Pune   28000  Data Engineer

In [45]:
df2[(df2["Age"] >= 21) & (df2["Town"] == "Nagpur")]

     Name  Age    Town  Salary   Designation
0  Pankaj   22  Nagpur   25000  Data Analyst

In [48]:
df2.describe

<bound method NDFrame.describe of      Name  Age    Town  Salary      Designation
0  Pankaj   22  Nagpur   25000     Data Analyst
1   Rahul   21  Mumbai   30000  Data Scientists
2  Aditya   23    Pune   28000    Data Engineer>

In [50]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Town    3 non-null      object
 3   Salary  3 non-null      int64
dtypes: int64(2), object(2)
memory usage: 228.0+ bytes